app/Controllers/Department.php

SELECT *
FROM `department`
---
    public function index(): string
    {
        $departmentModel = new \App\Models\DepartmentModel();
        $data['department'] = $departmentModel->findAll();