app/Controllers/Employees.php

SELECT *
FROM `employees`
SELECT *
FROM `department`
WHERE `id` = '2'
SELECT *
FROM `shift`
WHERE `id` = '2'
---
    public function index(): string
    {
        // Get user id from session
        $myId = session()->get('myId');

        // Load models
        $employees = new \App\Models\EmployeeModel();
        $department = new \App\Models\DepartmentModel();
        $shift = new \App\Models\ShiftModel();

        // Retrieve data from models
        $data['employees'] = $employees->findAll();
        $data['department'] = $department->where('id', $myId)->findAll();
        $data['shift'] = $shift->where('id', $myId)->findAll();

SELECT *
FROM `department`
SELECT *
FROM `shift`
---
    public function add(): string
    {
        $departmentModel = new \App\Models\DepartmentModel();
        $shiftModel = new \App\Models\ShiftModel();

        $data['department'] = $departmentModel->findAll();
        $data['shift'] = $shiftModel->findAll();

SELECT *
FROM `employees`
WHERE `employees`.`id` = '2'
SELECT *
FROM `department`
WHERE `id` = '2'
SELECT *
FROM `shift`
WHERE `id` = '2'
---
    public function view($id)
    {
        $myId = session()->get('myId');

        $employees = new \App\Models\EmployeeModel();
        $department = new \App\Models\DepartmentModel();
        $shift = new \App\Models\ShiftModel();

        $data['employees'] = $employees->find($id);
        $data['department'] = $department->where('id', $myId)->findAll();
        $data['shift'] = $shift->where('id', $myId)->findAll();

SELECT *
FROM `employees`
WHERE `employees`.`id` = '2'
SELECT *
FROM `department`
SELECT *
FROM `shift`
---
    public function edit($id)
    {
        $employees = new \App\Models\EmployeeModel();
        $department = new \App\Models\DepartmentModel();
        $shift = new \App\Models\ShiftModel();

        // Retrieve the employee data
        $data['employees'] = $employees->find($id);

        // Retrieve all departments and shifts
        $data['department'] = $department->findAll();
        $data['shift'] = $shift->findAll();