app/Controllers/Location.php

    public function index(): string
    {
        $locationModel = new \App\Models\LocationModel();
        $data['location'] = $locationModel->findAll();
---
SELECT *
FROM `location`