app/Controllers/Login.php

    public function login()
    {
        $data = array();
        helper(['form']);

        // Login button clicked
        if($this->request->getMethod() == 'post') {
            $post = $this->request->getPost(['email', 'password']);

            $rules = [
                'email' => ['label' => 'email', 'rules' => 'required|valid_email'],
                'password' => ['label' => 'password', 'rules' => 'required']
            ];

            if(! $this->validate($rules)) {
                $data['validation'] = $this->validator;
            } else {
                $employees = new \App\Models\EmployeeModel();
                $user = $employees->where('email', $post['email'])->where('password', $post['password'])->first(); // add sha1()
---
SELECT *
FROM `employees`
WHERE `email` = 'angelaarguelles04@gmail.com'
AND `password` = 'admin'
 LIMIT 1