app/Controllers/Shift.php

SELECT *
FROM `shift`
---
    public function index(): string
    {
        $shiftModel = new \App\Models\ShiftModel();
        $data['shift'] = $shiftModel->findAll();